damped_tank_withobj/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0  0  0 )//0
    (8 0 0)//1
    (8 1.2 0)//2
    (0 1.2 0)//3
    (0 0 16)//4
    (8 0 16)//5
    (8 1.2 16)//6
    (0 1.2 16)//7
    (40 0 0)//8
    (40 1.2 0)//9
    (40 0 16)//10
    (40 1.2 16)//11                
    (48 0 0)//12
    (48 1.2 0)//13
    (48 0 16)//14
    (48 1.2 16)//15
    (8 0 20)//16
    (40 0 20)//17
    (40 1.2 20)//18
    (8 1.2 20)//19
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (40 120 100) simpleGrading (1 1 1) //inlet
    hex (1 8 9 2 5 10 11 6) (160 120 100) simpleGrading (1 1 1) //main
    hex (8 12 13 9 10 14 15 11) (40 120 100) simpleGrading (1 1 1) //backout
    hex (5 10 11 6 16 17 18 19) (160 120 40) simpleGrading (1 1 1) //sideout
);

edges           
(
);

patches         
(
    patch inlet0
    (
        (0 4 7 3)
    )
    patch outlet1
    (
        (5 16 19 6)
        (16 17 18 19)
        (10 11 18 17)
    )
    patch outlet2
    (
        (10 14 15 11)
        (12 13 15 14)
        (8 9 13 12)
    )
    wall bottom
    (
        (0 1 5 4)
        (5 1 8 10)
        (8 12 14 10)
        (5 10 17 16)
    )
    wall side 
    (
        (4 5 6 7)
        (0 3 2 1)
    )
    patch atmos
    (
        (3 7 6 2)
        (2 6 11 9)
        (6 19 18 11)
        (9 11 15 13)
    )
    patch internalWall
    ()
);

mergePatchPairs
(
);

// ************************************************************************* //
